; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_2 ?v7 - type_1 ?v1 - type_3)
 	      (pred_3 ?v6 - object ?v1 - type_3)
	      (pred_1 ?v7 - type_1 ?v4 - type_2)
	      (pred_4 ?v7 - type_1 ?v6 - object ?v4 - type_2))

   (:action op_3
       :parameters  (?v7 - type_1 ?v5 ?v2 - type_3)
       :precondition (and  (pred_2 ?v7 ?v5))
       :effect (and  (pred_2 ?v7 ?v2)
		     (not (pred_2 ?v7 ?v5))))

   (:action op_1
       :parameters (?v7 - type_1 ?v3 - object ?v8 - type_3 ?v4 - type_2)
       :precondition  (and  (pred_3 ?v3 ?v8) (pred_2 ?v7 ?v8) (pred_1 ?v7 ?v4))
       :effect (and (pred_4 ?v7 ?v3 ?v4)
		    (not (pred_3 ?v3 ?v8)) 
		    (not (pred_1 ?v7 ?v4))))

   (:action op_2
       :parameters (?v7 - type_1 ?v3 - object ?v8 - type_3 ?v4 - type_2)
       :precondition  (and  (pred_4 ?v7 ?v3 ?v4) (pred_2 ?v7 ?v8))
       :effect (and (pred_3 ?v3 ?v8)
		    (pred_1 ?v7 ?v4)
		    (not (pred_4 ?v7 ?v3 ?v4)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_10 obj_08 - type_1
obj_02 obj_03 obj_11 obj_01 - type_2
obj_09 obj_07 obj_06 - type_3
obj_12 obj_04 obj_05 - object)
(:init
(pred_2 obj_10 obj_07)
(pred_1 obj_10 obj_02)
(pred_1 obj_10 obj_03)
(pred_2 obj_08 obj_06)
(pred_1 obj_08 obj_11)
(pred_1 obj_08 obj_01)
(pred_3 obj_12 obj_09)
(pred_3 obj_04 obj_06)
(pred_3 obj_05 obj_07)
)
(:goal
(and
(pred_3 obj_12 obj_06)
(pred_3 obj_04 obj_06)
(pred_3 obj_05 obj_06)
)
)

(:constraints
  (always (not (pred_2 obj_10 obj_06)))
)
)

; plan
1. (op_1 obj_10 obj_05 obj_07 obj_03)
   deleted: (pred_3 obj_05 obj_07) (pred_1 obj_10 obj_03)
   added: (pred_4 obj_10 obj_05 obj_03)
   goals met: 1 of 3
2. (op_3 obj_08 obj_06 obj_09)
   deleted: (pred_2 obj_08 obj_06)
   added: (pred_2 obj_08 obj_09)
   goals met: 1 of 3
3. (op_3 obj_10 obj_07 obj_09)
   deleted: (pred_2 obj_10 obj_07)
   added: (pred_2 obj_10 obj_09)
   goals met: 1 of 3
4. (op_1 obj_10 obj_12 obj_09 obj_02)
   deleted: (pred_3 obj_12 obj_09) (pred_1 obj_10 obj_02)
   added: (pred_4 obj_10 obj_12 obj_02)
   goals met: 1 of 3
5. (op_2 obj_10 obj_05 obj_09 obj_03)
   deleted: (pred_4 obj_10 obj_05 obj_03)
   added: (pred_3 obj_05 obj_09) (pred_1 obj_10 obj_03)
   goals met: 1 of 3
6. (op_1 obj_08 obj_05 obj_09 obj_01)
   deleted: (pred_3 obj_05 obj_09) (pred_1 obj_08 obj_01)
   added: (pred_4 obj_08 obj_05 obj_01)
   goals met: 1 of 3
7. (op_2 obj_10 obj_12 obj_09 obj_02)
   deleted: (pred_4 obj_10 obj_12 obj_02)
   added: (pred_3 obj_12 obj_09) (pred_1 obj_10 obj_02)
   goals met: 1 of 3
8. (op_3 obj_08 obj_09 obj_06)
   deleted: (pred_2 obj_08 obj_09)
   added: (pred_2 obj_08 obj_06)
   goals met: 1 of 3
9. (op_2 obj_08 obj_05 obj_06 obj_01)
   deleted: (pred_4 obj_08 obj_05 obj_01)
   added: (pred_3 obj_05 obj_06) (pred_1 obj_08 obj_01)
   goals met: 2 of 3
10. (op_3 obj_08 obj_06 obj_09)
   deleted: (pred_2 obj_08 obj_06)
   added: (pred_2 obj_08 obj_09)
   goals met: 2 of 3
11. (op_1 obj_08 obj_12 obj_09 obj_01)
   deleted: (pred_3 obj_12 obj_09) (pred_1 obj_08 obj_01)
   added: (pred_4 obj_08 obj_12 obj_01)
   goals met: 2 of 3
12. (op_3 obj_08 obj_09 obj_06)
   deleted: (pred_2 obj_08 obj_09)
   added: (pred_2 obj_08 obj_06)
   goals met: 2 of 3
13. (op_2 obj_08 obj_12 obj_06 obj_01)
   deleted: (pred_4 obj_08 obj_12 obj_01)
   added: (pred_3 obj_12 obj_06) (pred_1 obj_08 obj_01)
   goals met: 3 of 3
